In [88]:
import pandas as pd
import numpy as np
from datetime import datetime

In [89]:
# date = datetime.now().strftime('%d-%m-%Y')
date = '20-05-2025'
date

'20-05-2025'

In [90]:
new = pd.read_csv(f'input/{date}/obu_mapping_18-03-2025.csv', dtype=str)
old = pd.read_csv(f'input/{date}/fleet_device_mapping.csv', dtype=str)

# Convert column names to snake case and remove special characters
new.columns = new.columns.str.lower().str.replace('[^a-zA-Z0-9]', '_', regex=True).str.replace('__+', '_', regex=True).str.strip('_').str.strip()
old.columns = old.columns.str.lower().str.replace('[^a-zA-Z0-9]', '_', regex=True).str.replace('__+', '_', regex=True).str.strip('_').str.strip()

In [91]:
new.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2587 entries, 0 to 2586
Data columns (total 6 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   sr_no               2587 non-null   object
 1   depot               2587 non-null   object
 2   vehicle_reg_number  2587 non-null   object
 3   fleet_number        2587 non-null   object
 4   obu_device_id       2587 non-null   object
 5   created_date        2587 non-null   object
dtypes: object(6)
memory usage: 121.4+ KB

In [92]:
old.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3387 entries, 0 to 3386
Data columns (total 10 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   dep             3387 non-null   object
 1   fleet           3387 non-null   object
 2   type            3385 non-null   object
 3   regndate        3387 non-null   object
 4   obu_iemi        3114 non-null   object
 5   chalo_deviceid  2051 non-null   object
 6   date            3387 non-null   object
 7   vehicle_number  9 non-null      object
 8   depot           1 non-null      object
 9   ny_device_id    8 non-null      object
dtypes: object(10)
memory usage: 264.7+ KB

In [93]:
old[old['fleet'].duplicated(keep=False)].sort_values('fleet')

Empty DataFrame
Columns: [dep, fleet, type, regndate, obu_iemi, chalo_deviceid, date, vehicle_number, depot, ny_device_id]
Index: []

In [94]:
mapped = old.merge(new, left_on='fleet', right_on='fleet_number', how='left')
mapped

,dep,fleet,type,regndate,obu_iemi,chalo_deviceid,date,vehicle_number,depot_x,ny_device_id,sr_no,depot_y,vehicle_reg_number,fleet_number,obu_device_id,created_date
0,PR,J0236,ORDI,2013-06-14,862607059094994,NaN,2025-04-17T11:24:49,NaN,NaN,NaN,1729,Perambur Depot,TN01AN0628,J0236,862607059094994,2024-03-04T22:30:44.762454
1,AM,J0237,ORDI,2013-06-14,862607059102656,868728039343634,2025-04-17T11:24:49,NaN,NaN,NaN,1304,Ambathur Depot,TN01AN0625,J0237,862607059102656,2024-03-04T22:30:44.762454
2,AN,J0238,ORDI,2013-06-14,862607059210541,NaN,2025-04-17T11:24:49,NaN,NaN,NaN,1466,Annanagar Depot,TN01AN0632,J0238,862607059210541,2024-03-04T22:30:44.762454
3,EN,J0239,ORDI,2013-06-14,862607052169082,869244044516361,2025-04-17T11:24:49,NaN,NaN,NaN,445,Ennore Depot,TN01AN0630,J0239,862607052169082,2024-03-04T22:30:44.762454
4,PR,J0240,ORDI,2013-06-14,862607055711781,869244044535106,2025-04-17T11:24:49,NaN,NaN,NaN,1798,Perambur Depot,TN01AN0619,J0240,862607055711781,2024-03-04T22:30:44.762454
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
3382,PM,K0741,LF-K,2024-12-16,866041042272895,NaN,2025-04-17T11:24:49,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3383,PM,K0742,LF-K,2024-12-16,862607059117969,NaN,2025-04-17T11:24:49,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3384,PM,K0743,LF-K,2024-12-16,864337053466661,NaN,2025-04-17T11:24:49,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3385,PM,K0744,LF-K,2024-12-16,864513042810546,NaN,2025-04-17T11:24:49,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3386,PM,K0745,LF-G,2025-02-03,867032053707233,NaN,2025-04-17T11:24:49,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [95]:
mapped.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3387 entries, 0 to 3386
Data columns (total 16 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   dep                 3387 non-null   object
 1   fleet               3387 non-null   object
 2   type                3385 non-null   object
 3   regndate            3387 non-null   object
 4   obu_iemi            3114 non-null   object
 5   chalo_deviceid      2051 non-null   object
 6   date                3387 non-null   object
 7   vehicle_number      9 non-null      object
 8   depot_x             1 non-null      object
 9   ny_device_id        8 non-null      object
 10  sr_no               2580 non-null   object
 11  depot_y             2580 non-null   object
 12  vehicle_reg_number  2580 non-null   object
 13  fleet_number        2580 non-null   object
 14  obu_device_id       2580 non-null   object
 15  created_date        2580 non-null   object
dtypes: object(16)
memory usage: 423.5+ KB

In [96]:
changed_mapping = mapped[
      (~mapped['fleet_number'].isna()) & 
      (mapped['obu_iemi'] != mapped['obu_device_id'])
    ]
changed_mapping

,dep,fleet,type,regndate,obu_iemi,chalo_deviceid,date,vehicle_number,depot_x,ny_device_id,sr_no,depot_y,vehicle_reg_number,fleet_number,obu_device_id,created_date
1698,CD,J0003,NaN,2025-05-03,NaN,NaN,2025-05-05T15:13:25,TN01AN3946,C01,3012192925,1761,Perambur Depot,TN01N9747,J0003,862607059149228,2024-03-04T22:30:44.762454

In [97]:
changed_mapping.shape

(1, 16)

In [98]:
changed_mapping[['fleet', 'obu_device_id']].to_csv(
    f"output/{date}/changed-mapping.csv", index=False)

In [99]:
mapped[mapped['obu_iemi'].isin(changed_mapping['obu_device_id'])]

Empty DataFrame
Columns: [dep, fleet, type, regndate, obu_iemi, chalo_deviceid, date, vehicle_number, depot_x, ny_device_id, sr_no, depot_y, vehicle_reg_number, fleet_number, obu_device_id, created_date]
Index: []

In [100]:
old_test = old.copy()
old_test.shape

(3387, 10)

In [101]:
old_test['obu_iemi'] = np.where(old_test['fleet'].isin(
    mapped['fleet_number']), mapped['obu_device_id'], old_test['obu_iemi'])

old_test['depot'] = np.where(old_test['fleet'].isin(
    mapped['fleet_number']), mapped['depot_y'], old_test['depot'])

old_test['vehicle_number'] = np.where(old_test['fleet'].isin(
    mapped['fleet_number']), mapped['vehicle_reg_number'], old_test['vehicle_number'])

In [102]:
# Find rows where Obu Iemi appears more than once
duplicates = old_test[old_test['fleet'].duplicated(keep=False)].sort_values('fleet')
duplicates

Empty DataFrame
Columns: [dep, fleet, type, regndate, obu_iemi, chalo_deviceid, date, vehicle_number, depot, ny_device_id]
Index: []

In [103]:
# Find rows where Obu Iemi appears more than once
duplicates = old_test[old_test['obu_iemi'].duplicated(keep=False) & ~old_test['obu_iemi'].isna()].sort_values('obu_iemi')
duplicates

Empty DataFrame
Columns: [dep, fleet, type, regndate, obu_iemi, chalo_deviceid, date, vehicle_number, depot, ny_device_id]
Index: []

In [104]:
old[old['obu_iemi'].isin(duplicates['obu_iemi'])]

Empty DataFrame
Columns: [dep, fleet, type, regndate, obu_iemi, chalo_deviceid, date, vehicle_number, depot, ny_device_id]
Index: []

In [105]:
new[new['obu_device_id'].isin(duplicates['obu_iemi'])]

Empty DataFrame
Columns: [sr_no, depot, vehicle_reg_number, fleet_number, obu_device_id, created_date]
Index: []

In [106]:
tmp = old_test[~old_test['fleet'].isin(duplicates['fleet'])]
tmp.shape

(3387, 10)

In [107]:
tmp.to_csv(f"output/{date}/updated-fleet-mapping-no-duplicates.csv", index=False)